
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Загружает данные на сервере
//
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ИмяМенеджера = БП_ОбщегоНазначенияСервер.ПолучитьИмяЗначенияПеречисления(ВидОперации); 
	
	Попытка
		ОбработчикМенеджер = Обработки[ИмяМенеджера];
	Исключение   
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузчик не найден. Обратитесь к разработчику.'"));
		ВызватьИсключение;
		
	КонецПопытки;	
	
	ТекстЗапроса = ОбработчикМенеджер.ПолучитьТекстЗапроса();
	СтруктураПараметров = БП_ОбщегоНазначенияСервер.ПолучитьПараметрыЗапроса(ЭтаФорма, Элементы); 
	
	БП_ОбщегоНазначенияСервер.УстановитьПараметрыЗапроса(СтруктураПараметров, ТекстЗапроса); 
	БП_ИнтеграцияСервер.ЗагрузитьДанныеИзAxapta(ТекстЗапроса, ОбработчикМенеджер);
	
КонецПроцедуры	 

#КонецОбласти

